---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.TopRail
source: html/1d559a69-46db-d668-f063-7aac63af31a4.htm
---
# TopRail Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.